programacao_web/docker-main/www/codeigniter4/app/Controllers/Admin/Client.php

    public function listClients(){

        $ClientModel = new ClientModel();

        $data = [
            'arrayClients'=>$ClientModel->findAll()
        ];
---
SELECT *
FROM `clients`