programacao_web/docker-main/www/codeigniter4/app/Controllers/Client.php

SELECT *
FROM `clients`
---
    public function listClients(){

        $ClientModel = new ClientModel();
        $data = [
            'arrayClients'=>$ClientModel->findAll()
        ];